micropython/micropython/stmhal/cmsis/devinc/stm32l486xx.h
#define  RCC_PLLCFGR_PLLPEN                  ((uint32_t)0x00010000U)
#define  RCC_PLLCFGR_PLLP                    ((uint32_t)0x00020000U)
#define  RCC_PLLCFGR_PLLQEN                  ((uint32_t)0x00100000U)

#define  RCC_PLLCFGR_PLLQ                    ((uint32_t)0x00600000U)
#define  RCC_PLLCFGR_PLLQ_0                  ((uint32_t)0x00200000U)
#define  RCC_PLLCFGR_PLLQ_1                  ((uint32_t)0x00400000U)

#define  RCC_PLLCFGR_PLLREN                  ((uint32_t)0x01000000U)
#define  RCC_PLLCFGR_PLLR                    ((uint32_t)0x06000000U)
#define  RCC_PLLCFGR_PLLR_0                  ((uint32_t)0x02000000U)
#define  RCC_PLLCFGR_PLLR_1                  ((uint32_t)0x04000000U)

/********************  Bit definition for RCC_PLLSAI1CFGR register  ************/
#define  RCC_PLLSAI1CFGR_PLLSAI1N            ((uint32_t)0x00007F00U)
#define  RCC_PLLSAI1CFGR_PLLSAI1N_0          ((uint32_t)0x00000100U)
#define  RCC_PLLSAI1CFGR_PLLSAI1N_1          ((uint32_t)0x00000200U)
#define  RCC_PLLSAI1CFGR_PLLSAI1N_2          ((uint32_t)0x00000400U)
#define  RCC_PLLSAI1CFGR_PLLSAI1N_3          ((uint32_t)0x00000800U)
#define  RCC_PLLSAI1CFGR_PLLSAI1N_4          ((uint32_t)0x00001000U)
#define  RCC_PLLSAI1CFGR_PLLSAI1N_5          ((uint32_t)0x00002000U)
#define  RCC_PLLSAI1CFGR_PLLSAI1N_6          ((uint32_t)0x00004000U)

#define  RCC_PLLSAI1CFGR_PLLSAI1PEN          ((uint32_t)0x00010000U)
#define  RCC_PLLSAI1CFGR_PLLSAI1P            ((uint32_t)0x00020000U)

#define  RCC_PLLSAI1CFGR_PLLSAI1QEN          ((uint32_t)0x00100000U)
#define  RCC_PLLSAI1CFGR_PLLSAI1Q            ((uint32_t)0x00600000U)
#define  RCC_PLLSAI1CFGR_PLLSAI1Q_0          ((uint32_t)0x00200000U)
#define  RCC_PLLSAI1CFGR_PLLSAI1Q_1          ((uint32_t)0x00400000U)

#define  RCC_PLLSAI1CFGR_PLLSAI1REN          ((uint32_t)0x01000000U)
#define  RCC_PLLSAI1CFGR_PLLSAI1R            ((uint32_t)0x06000000U)
#define  RCC_PLLSAI1CFGR_PLLSAI1R_0          ((uint32_t)0x02000000U)
#define  RCC_PLLSAI1CFGR_PLLSAI1R_1          ((uint32_t)0x04000000U)

/********************  Bit definition for RCC_PLLSAI2CFGR register  ************/
#define  RCC_PLLSAI2CFGR_PLLSAI2N            ((uint32_t)0x00007F00U)
#define  RCC_PLLSAI2CFGR_PLLSAI2N_0          ((uint32_t)0x00000100U)
#define  RCC_PLLSAI2CFGR_PLLSAI2N_1          ((uint32_t)0x00000200U)
#define  RCC_PLLSAI2CFGR_PLLSAI2N_2          ((uint32_t)0x00000400U)
#define  RCC_PLLSAI2CFGR_PLLSAI2N_3          ((uint32_t)0x00000800U)
#define  RCC_PLLSAI2CFGR_PLLSAI2N_4          ((uint32_t)0x00001000U)
#define  RCC_PLLSAI2CFGR_PLLSAI2N_5          ((uint32_t)0x00002000U)
#define  RCC_PLLSAI2CFGR_PLLSAI2N_6          ((uint32_t)0x00004000U)

#define  RCC_PLLSAI2CFGR_PLLSAI2PEN          ((uint32_t)0x00010000U)
#define  RCC_PLLSAI2CFGR_PLLSAI2P            ((uint32_t)0x00020000U)

#define  RCC_PLLSAI2CFGR_PLLSAI2REN          ((uint32_t)0x01000000U)
#define  RCC_PLLSAI2CFGR_PLLSAI2R            ((uint32_t)0x06000000U)
#define  RCC_PLLSAI2CFGR_PLLSAI2R_0          ((uint32_t)0x02000000U)
#define  RCC_PLLSAI2CFGR_PLLSAI2R_1          ((uint32_t)0x04000000U)

/********************  Bit definition for RCC_CIER register  ******************/
#define  RCC_CIER_LSIRDYIE                   ((uint32_t)0x00000001U)
#define  RCC_CIER_LSERDYIE                   ((uint32_t)0x00000002U)
#define  RCC_CIER_MSIRDYIE                   ((uint32_t)0x00000004U)
#define  RCC_CIER_HSIRDYIE                   ((uint32_t)0x00000008U)
#define  RCC_CIER_HSERDYIE                   ((uint32_t)0x00000010U)
#define  RCC_CIER_PLLRDYIE                   ((uint32_t)0x00000020U)
#define  RCC_CIER_PLLSAI1RDYIE               ((uint32_t)0x00000040U)
#define  RCC_CIER_PLLSAI2RDYIE               ((uint32_t)0x00000080U)
#define  RCC_CIER_LSECSSIE                   ((uint32_t)0x00000200U)

/********************  Bit definition for RCC_CIFR register  ******************/
#define  RCC_CIFR_LSIRDYF                    ((uint32_t)0x00000001U)
#define  RCC_CIFR_LSERDYF                    ((uint32_t)0x00000002U)
#define  RCC_CIFR_MSIRDYF                    ((uint32_t)0x00000004U)
#define  RCC_CIFR_HSIRDYF                    ((uint32_t)0x00000008U)
#define  RCC_CIFR_HSERDYF                    ((uint32_t)0x00000010U)
#define  RCC_CIFR_PLLRDYF                    ((uint32_t)0x00000020U)
#define  RCC_CIFR_PLLSAI1RDYF                ((uint32_t)0x00000040U)
#define  RCC_CIFR_PLLSAI2RDYF                ((uint32_t)0x00000080U)
#define  RCC_CIFR_CSSF                       ((uint32_t)0x00000100U)
#define  RCC_CIFR_LSECSSF                    ((uint32_t)0x00000200U)

/********************  Bit definition for RCC_CICR register  ******************/
#define  RCC_CICR_LSIRDYC                    ((uint32_t)0x00000001U)
#define  RCC_CICR_LSERDYC                    ((uint32_t)0x00000002U)
#define  RCC_CICR_MSIRDYC                    ((uint32_t)0x00000004U)
#define  RCC_CICR_HSIRDYC                    ((uint32_t)0x00000008U)
#define  RCC_CICR_HSERDYC                    ((uint32_t)0x00000010U)
#define  RCC_CICR_PLLRDYC                    ((uint32_t)0x00000020U)
#define  RCC_CICR_PLLSAI1RDYC                ((uint32_t)0x00000040U)
#define  RCC_CICR_PLLSAI2RDYC                ((uint32_t)0x00000080U)
#define  RCC_CICR_CSSC                       ((uint32_t)0x00000100U)
#define  RCC_CICR_LSECSSC                    ((uint32_t)0x00000200U)

/********************  Bit definition for RCC_AHB1RSTR register  **************/
#define  RCC_AHB1RSTR_DMA1RST                ((uint32_t)0x00000001U)
#define  RCC_AHB1RSTR_DMA2RST                ((uint32_t)0x00000002U)
#define  RCC_AHB1RSTR_FLASHRST               ((uint32_t)0x00000100U)
#define  RCC_AHB1RSTR_CRCRST                 ((uint32_t)0x00001000U)
#define  RCC_AHB1RSTR_TSCRST                 ((uint32_t)0x00010000U)

/********************  Bit definition for RCC_AHB2RSTR register  **************/
#define  RCC_AHB2RSTR_GPIOARST               ((uint32_t)0x00000001U)
#define  RCC_AHB2RSTR_GPIOBRST               ((uint32_t)0x00000002U)
#define  RCC_AHB2RSTR_GPIOCRST               ((uint32_t)0x00000004U)
#define  RCC_AHB2RSTR_GPIODRST               ((uint32_t)0x00000008U)
#define  RCC_AHB2RSTR_GPIOERST               ((uint32_t)0x00000010U)
#define  RCC_AHB2RSTR_GPIOFRST               ((uint32_t)0x00000020U)
#define  RCC_AHB2RSTR_GPIOGRST               ((uint32_t)0x00000040U)
#define  RCC_AHB2RSTR_GPIOHRST               ((uint32_t)0x00000080U)
#define  RCC_AHB2RSTR_OTGFSRST               ((uint32_t)0x00001000U)
#define  RCC_AHB2RSTR_ADCRST                 ((uint32_t)0x00002000U)
#define  RCC_AHB2RSTR_AESRST                 ((uint32_t)0x00010000U)
#define  RCC_AHB2RSTR_RNGRST                 ((uint32_t)0x00040000U)

/********************  Bit definition for RCC_AHB3RSTR register  **************/
#define  RCC_AHB3RSTR_FMCRST                 ((uint32_t)0x00000001U)
#define  RCC_AHB3RSTR_QSPIRST                ((uint32_t)0x00000100U)

/********************  Bit definition for RCC_APB1RSTR1 register  **************/
#define  RCC_APB1RSTR1_TIM2RST               ((uint32_t)0x00000001U)
#define  RCC_APB1RSTR1_TIM3RST               ((uint32_t)0x00000002U)
#define  RCC_APB1RSTR1_TIM4RST               ((uint32_t)0x00000004U)
#define  RCC_APB1RSTR1_TIM5RST               ((uint32_t)0x00000008U)
#define  RCC_APB1RSTR1_TIM6RST               ((uint32_t)0x00000010U)
#define  RCC_APB1RSTR1_TIM7RST               ((uint32_t)0x00000020U)
#define  RCC_APB1RSTR1_LCDRST                ((uint32_t)0x00000200U)
#define  RCC_APB1RSTR1_SPI2RST               ((uint32_t)0x00004000U)
#define  RCC_APB1RSTR1_SPI3RST               ((uint32_t)0x00008000U)
#define  RCC_APB1RSTR1_USART2RST             ((uint32_t)0x00020000U)
#define  RCC_APB1RSTR1_USART3RST             ((uint32_t)0x00040000U)
#define  RCC_APB1RSTR1_UART4RST              ((uint32_t)0x00080000U)
#define  RCC_APB1RSTR1_UART5RST              ((uint32_t)0x00100000U)
#define  RCC_APB1RSTR1_I2C1RST               ((uint32_t)0x00200000U)
#define  RCC_APB1RSTR1_I2C2RST               ((uint32_t)0x00400000U)
#define  RCC_APB1RSTR1_I2C3RST               ((uint32_t)0x00800000U)
#define  RCC_APB1RSTR1_CAN1RST               ((uint32_t)0x02000000U)
#define  RCC_APB1RSTR1_PWRRST                ((uint32_t)0x10000000U)
#define  RCC_APB1RSTR1_DAC1RST               ((uint32_t)0x20000000U)
#define  RCC_APB1RSTR1_OPAMPRST              ((uint32_t)0x40000000U)
#define  RCC_APB1RSTR1_LPTIM1RST             ((uint32_t)0x80000000U)

/********************  Bit definition for RCC_APB1RSTR2 register  **************/
#define  RCC_APB1RSTR2_LPUART1RST            ((uint32_t)0x00000001U)
#define  RCC_APB1RSTR2_SWPMI1RST             ((uint32_t)0x00000004U)
#define  RCC_APB1RSTR2_LPTIM2RST             ((uint32_t)0x00000020U)

/********************  Bit definition for RCC_APB2RSTR register  **************/
#define  RCC_APB2RSTR_SYSCFGRST              ((uint32_t)0x00000001U)
#define  RCC_APB2RSTR_SDMMC1RST              ((uint32_t)0x00000400U)
#define  RCC_APB2RSTR_TIM1RST                ((uint32_t)0x00000800U)
#define  RCC_APB2RSTR_SPI1RST                ((uint32_t)0x00001000U)
#define  RCC_APB2RSTR_TIM8RST                ((uint32_t)0x00002000U)
#define  RCC_APB2RSTR_USART1RST              ((uint32_t)0x00004000U)
#define  RCC_APB2RSTR_TIM15RST               ((uint32_t)0x00010000U)
#define  RCC_APB2RSTR_TIM16RST               ((uint32_t)0x00020000U)
#define  RCC_APB2RSTR_TIM17RST               ((uint32_t)0x00040000U)
#define  RCC_APB2RSTR_SAI1RST                ((uint32_t)0x00200000U)
#define  RCC_APB2RSTR_SAI2RST                ((uint32_t)0x00400000U)
#define  RCC_APB2RSTR_DFSDMRST               ((uint32_t)0x01000000U)

/********************  Bit definition for RCC_AHB1ENR register  ***************/
#define  RCC_AHB1ENR_DMA1EN                  ((uint32_t)0x00000001U)
#define  RCC_AHB1ENR_DMA2EN                  ((uint32_t)0x00000002U)
#define  RCC_AHB1ENR_FLASHEN                 ((uint32_t)0x00000100U)
#define  RCC_AHB1ENR_CRCEN                   ((uint32_t)0x00001000U)
#define  RCC_AHB1ENR_TSCEN                   ((uint32_t)0x00010000U)

/********************  Bit definition for RCC_AHB2ENR register  ***************/
#define  RCC_AHB2ENR_GPIOAEN                 ((uint32_t)0x00000001U)
#define  RCC_AHB2ENR_GPIOBEN                 ((uint32_t)0x00000002U)
#define  RCC_AHB2ENR_GPIOCEN                 ((uint32_t)0x00000004U)
#define  RCC_AHB2ENR_GPIODEN                 ((uint32_t)0x00000008U)
#define  RCC_AHB2ENR_GPIOEEN                 ((uint32_t)0x00000010U)
#define  RCC_AHB2ENR_GPIOFEN                 ((uint32_t)0x00000020U)
#define  RCC_AHB2ENR_GPIOGEN                 ((uint32_t)0x00000040U)
#define  RCC_AHB2ENR_GPIOHEN                 ((uint32_t)0x00000080U)
#define  RCC_AHB2ENR_OTGFSEN                 ((uint32_t)0x00001000U)
#define  RCC_AHB2ENR_ADCEN                   ((uint32_t)0x00002000U)
#define  RCC_AHB2ENR_AESEN                   ((uint32_t)0x00010000U)
#define  RCC_AHB2ENR_RNGEN                   ((uint32_t)0x00040000U)

